000010*Property of FIS©. or its affiliates
000020*all rights reserved. FIS Confidential
000030 IDENTIFICATION DIVISION.
000040 PROGRAM-ID.           CACECLMB.
000050 AUTHOR.               PRASUNA SINGARAJU.
000060 DATE-WRITTEN.         16-MAY-2019.
000070****************************************************************
000080*   $Modtime::   10 Jan 2020 04:10:24  $
000090*   $Log::   P:/pvcsproj/DONOTUSE.prj/source/CACECLMB.COV       $
000100*
000110*   Rev 1.0.1.2   13 Jan 2020 05:26:04   rohini
000120*HSM0075
000130*HSM0075 Changes
000140*
000150*   Rev 1.0.1.1   07 Aug 2019 07:45:52   rohini
000160*HSM0033
000170*HSM0033 Changes
000180*
000190*
000200*   REQUIREMENTS:
000210*                   FDP-SCAT-KEY  
000220*                   FDP-CYC-DT, FDP-EFF-DT, FDP-BOOK-DT,
000230****************************************************************
000240*
000250*                     CHANGES LOG
000260*
000270*   DATE      PRG   PROJ#     DESCRIPTION
000280*  ---------  --- --------- ----------------------------------------
000290*  19-JUL-19  RT   HSM0033    NEW PROGRAM
000300*  10-JAN-20  RT   HSM0075    CHECK DATE
000310******************************************************************
000320 ENVIRONMENT DIVISION.
000330 CONFIGURATION SECTION.
000340*
000350 DATA DIVISION.
000360 WORKING-STORAGE SECTION.
000370
000380* TRANSACT_DETAILS
000390     COPY  CL1TDTLD.
000400* SCHED_ACTIVITY    
000410     COPY  CL1SCATD.
000420* TRANSACT_DETAILS
000430     COPY  CL6VTDTD.
000440
000450 01  WS-PROG-NM                        PIC X(8) VALUE 'CACECLMB'. 
000460
000470 01  WS-LOCAL-DATA.
000480     05  ITDTL                         PIC S9(4) COMP.
000490     05  WS-FDP-SCAT-KEY               PIC S9(15) COMP-3.
000500     05  WS-SAVE-FDP-BJLG-KEY          PIC S9(15) COMP-3.
000510     05  WS-SAVE-FDP-EFF-DT            PIC X(10).
000520     05  WS-SAVE-FDP-BOOK-DT           PIC X(10).
000530
000540*********************************************************
000550**   P R O C E D U R E    D I V I S I O N              **
000560*********************************************************
000570
000580**  REVISION AREA **                        
000590 01  WS-REVISION           PIC X(35)  VALUE 
000600     ' $Revision::   1.0.1.2        $'.
000610 LINKAGE SECTION.
000620     COPY  CLKFDPNC.
000630     COPY  CL1CASDD.
000640     COPY  CLKERRBC.
000650
000660 PROCEDURE DIVISION USING RMESSAGE,
000670                          CASD1-DATA,
000680                          RTN-OUTPUT-FIELDS.
000690
000700
000710     IF FDP-DEBUG-RUNSTAT > '00'
000720        ADD +1  TO RTN-DIMT-CNT
000730        MOVE WHEN-COMPILED TO 
000740             RTN-DIMT-COMPILE-DATE (RTN-DIMT-CNT)
000750        MOVE WS-REVISION (16:10) TO
000760             RTN-DIMT-REVISION (RTN-DIMT-CNT)
000770        MOVE WS-PROG-NM TO
000780           RTN-DIMT-PROGRAM-NAME (RTN-DIMT-CNT)
000790        CALL 'CUTDIMTD' USING RMESSAGE,
000800                              RTN-OUTPUT-FIELDS
000810     END-IF.
000820
000830 MAIN-ROUTINE.
000840**************************************************************
000850*    PROGRAM START
000860***************************************************************
000870**
000880**   EDIT FDP FIELDS
000890**
000900     PERFORM A050-EDIT-LINK
000910        THRU A050-EXIT.
000920*
000930     IF RTN-NO-ERROR
000940        PERFORM A100-READ-TDTL
000950           THRU A100-EXIT
000960     END-IF.
000970*
000980     IF RTN-NO-ERROR
000990        IF VTDT6-TOTAL-ROWS = ZEROES
001000           PERFORM A200-READ-REVERSE-TDTL
001010              THRU A200-EXIT
001020        END-IF
001030     END-IF.
001040
001050     IF RTN-NO-ERROR
001060        IF VTDT6-TOTAL-ROWS > 1
001070           PERFORM X300-RESET-TDTL-SCAT-KEY
001080              THRU X300-EXIT
001090
001100           IF RTN-NO-ERROR
001110              MOVE WS-FDP-SCAT-KEY     TO FDP-SCAT-KEY
001120              MOVE WS-SAVE-FDP-BOOK-DT TO FDP-BOOK-DT
001130              MOVE WS-SAVE-FDP-EFF-DT  TO FDP-EFF-DT
001140           END-IF
001150        END-IF
001160     END-IF.
001170
001180 MAIN-ROUTINE-EXIT.
001190     EXIT.
001200
001210**   E N D     O F    P R O G R A M
001220**
001230
001240     GOBACK.
001250
001260 A050-EDIT-LINK.
001270*
001280     IF FDP-EFF-DT = SPACES
001290        MOVE 'UT'                  TO RTN-ERR-PREFIX
001300        MOVE 35                    TO RTN-ERROR-CODE
001310        MOVE WS-PROG-NM            TO RTN-PROG-NAME
001320        MOVE 'A050-EDIT-LINK'      TO RTN-PARA-NAME
001330        CALL 'CUTSVARB'         USING RMESSAGE 
001340                                    , RTN-OUTPUT-FIELDS
001350     END-IF.
001360*
001370     IF FDP-CYC-DT = SPACES AND RTN-NO-ERROR
001380        MOVE 'UT'                  TO RTN-ERR-PREFIX
001390        MOVE 36                    TO RTN-ERROR-CODE
001400        MOVE WS-PROG-NM            TO RTN-PROG-NAME
001410        MOVE 'A050-EDIT-LINK'      TO RTN-PARA-NAME
001420        CALL 'CUTSVARB'         USING RMESSAGE 
001430                                    , RTN-OUTPUT-FIELDS
001440     END-IF.
001450*
001460     IF FDP-SCAT-KEY <= ZEROES AND RTN-NO-ERROR
001470        MOVE 'UT'                  TO RTN-ERR-PREFIX
001480        MOVE 42                    TO RTN-ERROR-CODE
001490        MOVE WS-PROG-NM            TO RTN-PROG-NAME
001500        MOVE 'A050-EDIT-LINK'      TO RTN-PARA-NAME
001510        CALL 'CUTSVARB'         USING RMESSAGE 
001520                                    , RTN-OUTPUT-FIELDS
001530     END-IF.
001540*
001550     IF FDP-BOOK-DT = SPACES AND RTN-NO-ERROR
001560        MOVE 'UT'                  TO RTN-ERR-PREFIX
001570        MOVE 45                    TO RTN-ERROR-CODE
001580        MOVE WS-PROG-NM            TO RTN-PROG-NAME
001590        MOVE 'A050-EDIT-LINK'      TO RTN-PARA-NAME
001600        CALL 'CUTSVARB'         USING RMESSAGE 
001610                                    , RTN-OUTPUT-FIELDS
001620     END-IF.
001630
001640 A050-EXIT.
001650     EXIT.
001660
001670 A100-READ-TDTL.
001680
001690     INITIALIZE VTDT6-DATA.
001700     MOVE FDP-SCAT-KEY             TO VTDT6-SCAT-KEY (1)
001710                                      WS-FDP-SCAT-KEY.
001720** '2' - Notional
001730     MOVE '2'                      TO VTDT6-STAT-CD (1).
001740
001750     PERFORM UNTIL VTDT6-END-FLAG = 'Y'
001760          OR RTN-ERROR
001770             CALL 'CFA3TDTD'    USING RMESSAGE
001780                                    , VTDT6-DATA
001790                                    , RTN-OUTPUT-FIELDS
001800 
001810             IF RTN-NO-ERROR
001820                IF VTDT6-TOTAL-ROWS = 1
001830                   MOVE FDP-EFF-DT       TO WS-SAVE-FDP-EFF-DT
001840                   MOVE FDP-BOOK-DT      TO WS-SAVE-FDP-BOOK-DT
001850                   MOVE VTDT6-EFF-DT (1) TO FDP-EFF-DT
001860                                            FDP-BOOK-DT
001870                   PERFORM X100-CALL-CTXACCTB
001880                      THRU X100-EXIT 
001890                   MOVE WS-SAVE-FDP-BOOK-DT TO FDP-BOOK-DT
001900                   MOVE WS-SAVE-FDP-EFF-DT  TO FDP-EFF-DT
001910                ELSE
001920                   PERFORM VARYING ITDTL FROM 1 BY 1
001930                     UNTIL ITDTL > VTDT6-ROWS-FOUND
001940                        OR RTN-ERROR
001950                           PERFORM B100-PROCESS-TDTL
001960                              THRU B100-EXIT
001970                   END-PERFORM
001980                END-IF
001990             END-IF
002000     END-PERFORM.
002010
002020 A100-EXIT.
002030     EXIT.
002040
002050 A200-READ-REVERSE-TDTL.
002060
002070     INITIALIZE VTDT6-DATA.
002080     MOVE FDP-SCAT-KEY             TO VTDT6-SCAT-KEY (1) 
002090                                      WS-FDP-SCAT-KEY.
002100** '2' - Notional
002110     MOVE '2'                      TO VTDT6-STAT-CD (1).
002120
002130     PERFORM UNTIL VTDT6-END-FLAG = 'Y'
002140          OR RTN-ERROR
002150             CALL 'CFA4TDTD'    USING RMESSAGE
002160                                    , VTDT6-DATA
002170                                    , RTN-OUTPUT-FIELDS
002180 
002190             IF RTN-NO-ERROR
002200                IF VTDT6-TOTAL-ROWS = 1
002210                   PERFORM X100-CALL-CTXACCTB
002220                      THRU X100-EXIT
002230                ELSE
002240                   PERFORM VARYING ITDTL FROM 1 BY 1
002250                     UNTIL ITDTL > VTDT6-ROWS-FOUND
002260                        OR RTN-ERROR
002270                           PERFORM B100-PROCESS-TDTL
002280                              THRU B100-EXIT
002290                   END-PERFORM
002300                END-IF
002310             END-IF
002320     END-PERFORM.
002330
002340     
002350 A200-EXIT.
002360     EXIT.
002370
002380 B100-PROCESS-TDTL.
002390
002400     IF VTDT6-EFF-DT (ITDTL) < FDP-EFF-DT
002410        MOVE FDP-EFF-DT       TO WS-SAVE-FDP-EFF-DT
002420        MOVE FDP-BOOK-DT      TO WS-SAVE-FDP-BOOK-DT
002430        MOVE FDP-BJLG-KEY     TO WS-SAVE-FDP-BJLG-KEY
002440
002450        PERFORM B200-INSERT-SCAT
002460           THRU B200-EXIT
002470
002480        IF RTN-NO-ERROR
002490           PERFORM X200-UPDATE-TRANSACT-DETL
002500              THRU X200-EXIT
002510        END-IF
002520
002530        IF RTN-NO-ERROR
002540           PERFORM X100-CALL-CTXACCTB
002550              THRU X100-EXIT
002560        END-IF
002570
002580        IF RTN-NO-ERROR
002590           PERFORM X400-UPDATE-SCHED-ACTIVITY
002600              THRU X400-EXIT
002610        END-IF
002620            
002630        MOVE WS-SAVE-FDP-BJLG-KEY  TO FDP-BJLG-KEY
002640        MOVE WS-SAVE-FDP-EFF-DT    TO FDP-EFF-DT
002650        MOVE WS-SAVE-FDP-BOOK-DT   TO FDP-BOOK-DT
002660        MOVE WS-FDP-SCAT-KEY       TO FDP-SCAT-KEY
002670
002680     ELSE
002690        
002700*       DO NOTHING IF DATE IS GREATER THAN FDP-EFF-DT             HSM0075
002710*       TO AVOID  DUPLICATE ACCOUNTING                            HSM0075
002720        IF VTDT6-EFF-DT (ITDTL) = FDP-EFF-DT                      HSM0075
002730           PERFORM X100-CALL-CTXACCTB
002740              THRU X100-EXIT
002750        END-IF                                                    HSM0075
002760
002770     END-IF.
002780
002790 B100-EXIT.
002800     EXIT.
002810
002820 B200-INSERT-SCAT.
002830 
002840     INITIALIZE SCAT1-DATA.
002850     MOVE WS-FDP-SCAT-KEY          TO SCAT1-GRP-SCAT-KEY.
002860     MOVE FDP-PRDF-KEY             TO SCAT1-PRDF-KEY. 
002870     MOVE FDP-TR-REF-NO            TO SCAT1-TR-REF-NO. 
002880     MOVE FDP-CASE-KEY             TO SCAT1-CASE-KEY.
002890     MOVE FDP-CASE-MBR-KEY         TO SCAT1-CASE-MBR-KEY.  
002900     MOVE FDP-CYC-DT               TO SCAT1-CYC-DT         
002910                                      SCAT1-PROC-DT.
002920     MOVE VTDT6-EFF-DT (ITDTL)     TO SCAT1-EFF-DT         
002930                                      SCAT1-DUE-DT         
002940                                      SCAT1-TX-DT          
002950                                      SCAT1-BOOK-DT. 
002960     MOVE '0'                      TO SCAT1-STAT-CD. 
002970     MOVE ZEROS                    TO SCAT1-CSRL-KEY         
002980                                      SCAT1-SCAT-KEY           
002990                                      SCAT1-TSCH-KEY.
003000     MOVE ZEROES                   TO FDP-BJLG-KEY.
003010     MOVE SPACES                   TO SCAT1-UNALLOC-ACCT-CD.
003020     MOVE SPACES                   TO SCAT1-BEN-CAT-NO.
003030     CALL 'CI1SCATD'            USING RMESSAGE
003040                                    , SCAT1-DATA
003050                                    , RTN-OUTPUT-FIELDS.
003060
003070     IF RTN-NO-ERROR
003080        MOVE SCAT1-SCAT-KEY        TO FDP-SCAT-KEY
003090     END-IF.
003100 
003110     MOVE VTDT6-EFF-DT (ITDTL)     TO FDP-EFF-DT
003120                                      FDP-BOOK-DT.
003130 
003140 B200-EXIT.
003150     EXIT.

003170 X100-CALL-CTXACCTB.
003180
003190     CALL 'CTXACCTB'            USING RMESSAGE
003200                                    , CASD1-DATA
003210                                    , RTN-OUTPUT-FIELDS.
003220
003230 X100-EXIT.
003240     EXIT.
003250
003260 X200-UPDATE-TRANSACT-DETL.
003270
003280     INITIALIZE TDTL1-DATA.
003290     MOVE WS-FDP-SCAT-KEY          TO TDTL1-ORIG-SCAT-KEY.
003300     MOVE SCAT1-SCAT-KEY           TO TDTL1-SCAT-KEY.
003310     MOVE VTDT6-EFF-DT (ITDTL)     TO TDTL1-EFF-DT.
003320     CALL 'CU91TDTD'            USING RMESSAGE
003330                                    , TDTL1-DATA
003340                                    , RTN-OUTPUT-FIELDS.
003350
003360 X200-EXIT.
003370     EXIT.
003380
003390 X300-RESET-TDTL-SCAT-KEY.
003400
003410     MOVE WS-FDP-SCAT-KEY          TO TDTL1-ORIG-SCAT-KEY.
003420     CALL 'CU92TDTD'            USING RMESSAGE
003430                                    , TDTL1-DATA
003440                                    , RTN-OUTPUT-FIELDS.
003450
003460 X300-EXIT.
003470     EXIT.
003480
003490 X400-UPDATE-SCHED-ACTIVITY.
003500
003510     MOVE FDP-SCAT-KEY             TO SCAT1-SCAT-KEY.
003520*** '2' Processed
003530     MOVE '2'                      TO SCAT1-STAT-CD.
003540     CALL 'CU1SCATD'            USING RMESSAGE
003550                                    , SCAT1-DATA
003560                                    , RTN-OUTPUT-FIELDS.
003570
003580 X400-EXIT.
003590     EXIT.
003600
