000010*Property of FIS© or its affiliates,
000020*all rights reserved. FIS Confidential
000030 IDENTIFICATION DIVISION.
000040 PROGRAM-ID.           CCFUNSCB.
000050 AUTHOR.               G. V. CATALANO.
000060 DATE-WRITTEN.         2015-08-03.
000070****************************************************************
000080*   $Modtime::   18 Oct 2018 11:23:36  $
000090*   $Log::   P:/pvcsproj/DONOTUSE.prj/source/CCFUNSCB.COV       $
000100*
000110*   Rev 1.0.1.2   18 Oct 2018 12:39:52   alex
000120*FDM4167
000130*fis
000140*
000150*   Rev 1.0.1.1   15 Jul 2016 09:37:00   catherine
000160*ADM0004
000170*U/W CHANGES - AUTO ACCEPTANCE
000180*
000190*
000200* THIS PROGRAM WILL BE USED TO EVALUATE THE UNDERWRITING
000210* SPECIAL CONDITIONS. IT WILL CALL A STORED PROCEDURE
000220* THAT WILL DO THIS.  IF ANY OF THE CONDITIONS ARE MET THEN IT
000230* WILL PASS BACK '01' - YES.  IF NO CONDITIONS ARE MET THEN IT
000240* WILL PASS BACK '00' - NO.  THE RESULTS FOR EACH EVALUATION
000250* WILL BE STORED IN TABLE UNDW_EVAL_RESULTS.
000260* THE CUSTOM FORMULA PROGRAM IS CALLED FROM THE UNDERWRITING
000270* TRANCHE SELECTION UTILITY CUTUNDWB, WHICH USES THE VALUE
000280* FOR TRANCHE SELECTION.
000290****************************************************************
000300*                     CHANGES LOG
000310****************************************************************
000320*
000330*   DATE     PRG   PROJ#      DESCRIPTION
000340*  --------  --- ---------  --------------------------------------
000350* 08-JUN-16  CMS  ADM0004   INITIAL CODING.
000360****************************************************************
000370 ENVIRONMENT DIVISION.
000380 CONFIGURATION SECTION.
000390*
000400 DATA DIVISION.
000410 WORKING-STORAGE SECTION.
000420
000430 01  WS-MISC-VARIABLES.
000440     05  WS-PROG-NAME                PIC X(8) VALUE 'CCFUNSCB'.
000450
000460 01  WS-ERROR-MESSAGES.
000470**   SPECIFIC ERROR MESSAGES TO ACCOMPANY SYSTEM VARIANCE AS DETL
000480     05  WS-VAR-MSG-EFF.
000490         10  WS-VAR-EFF-DESC              PIC X(20).
000500         10  WS-VAR-EFF-DATE              PIC X(10).
000510     05  WS-VAR-MSG.
000520         10  WS-VAR-DESC                  PIC X(20).
000530         10  WS-VAR-CD                    PIC X(25).
000540
000550**
000560**   COPYBOOKS
000570**
000580*    COPYBOOK FOR UNDERWRITING STORED PROC
000590     COPY CL1UWEVD.
000600
000610*********************************************************
000620**   P R O C E D U R E    D I V I S I O N              **
000630*********************************************************
000640**  REVISION AREA **
000650 01  WS-REVISION           PIC X(35)  VALUE
000660     ' $Revision::   1.0.1.2        $'.
000670 LINKAGE SECTION.
000680     COPY   CLKFDPNC.
000690     COPY   CL1CUFMD.
000700     COPY   CLKCUFML.
000710     COPY   CL1UWRLD.
000720     COPY   CLKERRBC.
000730
000740 PROCEDURE DIVISION USING RMESSAGE
000750                          CUFM1-DATA
000760                          CUFM-DATA
000770                          UWRL1-DATA
000780                          RTN-OUTPUT-FIELDS.
000790     IF FDP-DEBUG-RUNSTAT > '00'
000800        ADD +1  TO RTN-DIMT-CNT
000810        MOVE WHEN-COMPILED TO
000820             RTN-DIMT-COMPILE-DATE (RTN-DIMT-CNT)
000830        MOVE WS-REVISION (16:10) TO
000840             RTN-DIMT-REVISION (RTN-DIMT-CNT)
000850        MOVE WS-PROG-NAME TO
000860           RTN-DIMT-PROGRAM-NAME (RTN-DIMT-CNT)
000870        CALL 'CUTDIMTD' USING RMESSAGE,
000880                              RTN-OUTPUT-FIELDS
000890     END-IF.
000900
000910******************************************************************
000920**                MAIN ROUTINE                                  **
000930******************************************************************
000940
000950     PERFORM A000-EDIT-LINKAGE
000960        THRU A000-EXIT.
000970
000980     IF RTN-NO-ERROR
000990        PERFORM B000-MAIN
001000           THRU B000-MAIN-EXIT
001010     END-IF.
001020
001030     GOBACK.
001040
001050******************************************************************
001060**                MAIN ROUTINE END                              **
001070******************************************************************
001080
001090 A000-EDIT-LINKAGE.
001100
001110     IF FDP-CYC-DT = SPACES
001120        MOVE 'UT'              TO RTN-ERR-PREFIX
001130        MOVE 36                TO RTN-ERROR-CODE
001140        MOVE WS-PROG-NAME      TO RTN-PROG-NAME
001150        MOVE 'A000-EDIT-LINK'  TO RTN-PARA-NAME
001160        CALL 'CUTSVARB'    USING  RMESSAGE,
001170                                  RTN-OUTPUT-FIELDS
001180     END-IF.
001190*
001200
001210     IF FDP-EFF-DT = SPACES
001220        MOVE 'UT'              TO RTN-ERR-PREFIX
001230        MOVE 35                TO RTN-ERROR-CODE
001240        MOVE WS-PROG-NAME      TO RTN-PROG-NAME
001250        MOVE 'A000-EDIT-LINK'  TO RTN-PARA-NAME
001260        CALL 'CUTSVARB'    USING  RMESSAGE,
001270                                  RTN-OUTPUT-FIELDS
001280     END-IF.
001290*
001300     IF FDP-TR-REF-NO = SPACES AND RTN-NO-ERROR
001310        MOVE 'UT'             TO RTN-ERR-PREFIX
001320        MOVE 34               TO RTN-ERROR-CODE
001330        MOVE WS-PROG-NAME     TO RTN-PROG-NAME
001340        MOVE 'A000-EDIT-LINK' TO RTN-PARA-NAME
001350        CALL 'CUTSVARB'    USING RMESSAGE,
001360                                 RTN-OUTPUT-FIELDS
001370     END-IF.
001380*
001390 A000-EXIT.
001400     EXIT.
001410
001420
001430 B000-MAIN.
001440
001450     INITIALIZE UWEV1-DATA.
001460     MOVE FDP-EFF-DT         TO UWEV1-EFF-DT.
001470     MOVE FDP-TR-REF-NO      TO UWEV1-TR-REF-NO.
001480     MOVE FDP-CASE-KEY       TO UWEV1-CASE-KEY
001490     MOVE FDP-CASE-MBR-KEY   TO UWEV1-CASE-MBR-KEY
001500     MOVE UWRL1-UWRL-KEY     TO UWEV1-UWRL-KEY
001510* CALL THE STORED PROCEDURE THAT EVALUATES THE SPECIAL CONDITIONS
001520     CALL 'CP1UWEVD'          USING RMESSAGE
001530                                   ,UWEV1-DATA
001540                                   ,RTN-OUTPUT-FIELDS
001550     IF RTN-NO-ERROR
001560        MOVE UWEV1-CUST-EVAL-DATA-CD  TO CUFM-AMT
001570     ELSE
001580
001590        MOVE WS-PROG-NAME     TO RTN-PROG-NAME
001600        MOVE 'UT'             TO RTN-ERR-PREFIX
001610        MOVE 790              TO RTN-ERROR-CODE
001620        MOVE 'B000-MAIN'      TO RTN-PARA-NAME
001630        MOVE 'CUSTOM FORMULA'        TO WS-VAR-DESC
001640        MOVE CUFM1-DESCRIPT          TO WS-VAR-CD
001650        MOVE WS-VAR-MSG              TO RTN-VAR-TEXT (1)
001660        MOVE 1                       TO RTN-VAR-SEQ-NO (1)
001670        MOVE 1                       TO RTN-VAR-DETL-CNT
001680        CALL 'CUTSVARB'    USING RMESSAGE,
001690                                 RTN-OUTPUT-FIELDS
001700     END-IF.
001710
001720 B000-MAIN-EXIT.
001730     EXIT.
001740****************************************************************
